zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph0/PERI_FTFC.h
/*! @name FCSESTAT - Flash CSEc Status Register */
/*! @{ */

#define FTFC_FCSESTAT_BSY_MASK                   (0x1U)
#define FTFC_FCSESTAT_BSY_SHIFT                  (0U)
/*! BSY - Busy
 *  0b0..CSEc command processing has completed
 *  0b1..CSEc command processing is in progress
 */
#define FTFC_FCSESTAT_BSY(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BSY_SHIFT)) & FTFC_FCSESTAT_BSY_MASK)

#define FTFC_FCSESTAT_SB_MASK                    (0x2U)
#define FTFC_FCSESTAT_SB_SHIFT                   (1U)
/*! SB - Secure Boot
 *  0b0..Secure boot not activated
 *  0b1..Secure boot is activated
 */
#define FTFC_FCSESTAT_SB(x)                      (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_SB_SHIFT)) & FTFC_FCSESTAT_SB_MASK)

#define FTFC_FCSESTAT_BIN_MASK                   (0x4U)
#define FTFC_FCSESTAT_BIN_SHIFT                  (2U)
/*! BIN - Secure Boot Initialization
 *  0b0..Secure boot personalization not completed.
 *  0b1..Secure boot personalization has completed
 */
#define FTFC_FCSESTAT_BIN(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BIN_SHIFT)) & FTFC_FCSESTAT_BIN_MASK)

#define FTFC_FCSESTAT_BFN_MASK                   (0x8U)
#define FTFC_FCSESTAT_BFN_SHIFT                  (3U)
/*! BFN - Secure Boot Finished
 *  0b0..Secure Boot is not finished.
 *  0b1..Secure Boot has finished
 */
#define FTFC_FCSESTAT_BFN(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BFN_SHIFT)) & FTFC_FCSESTAT_BFN_MASK)

#define FTFC_FCSESTAT_BOK_MASK                   (0x10U)
#define FTFC_FCSESTAT_BOK_SHIFT                  (4U)
/*! BOK - Secure Boot OK
 *  0b0..Secure boot is not complete, or secure boot failure
 *  0b1..Secure boot was successful.
 */
#define FTFC_FCSESTAT_BOK(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BOK_SHIFT)) & FTFC_FCSESTAT_BOK_MASK)

#define FTFC_FCSESTAT_RIN_MASK                   (0x20U)
#define FTFC_FCSESTAT_RIN_SHIFT                  (5U)
/*! RIN - Random Number Generator Initialized
 *  0b0..Random number generator is not initialized.
 *  0b1..Random number generator is initialized.
 */
#define FTFC_FCSESTAT_RIN(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_RIN_SHIFT)) & FTFC_FCSESTAT_RIN_MASK)

#define FTFC_FCSESTAT_EDB_MASK                   (0x40U)
#define FTFC_FCSESTAT_EDB_SHIFT                  (6U)
/*! EDB - External Debug
 *  0b0..External debugger not attached
 *  0b1..External debugger is attached
 */
#define FTFC_FCSESTAT_EDB(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_EDB_SHIFT)) & FTFC_FCSESTAT_EDB_MASK)

#define FTFC_FCSESTAT_IDB_MASK                   (0x80U)
#define FTFC_FCSESTAT_IDB_SHIFT                  (7U)
/*! IDB - Internal Debug
 *  0b0..Internal debug functions are disabled
 *  0b1..Internal debugger functions are enabled
 */
#define FTFC_FCSESTAT_IDB(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_IDB_SHIFT)) & FTFC_FCSESTAT_IDB_MASK)
/*! @} */

/*! @name FERSTAT - Flash Error Status Register */
/*! @{ */

#define FTFC_FERSTAT_DFDIF_MASK                  (0x2U)
#define FTFC_FERSTAT_DFDIF_SHIFT                 (1U)
/*! DFDIF - Double Bit Fault Detect Interrupt Flag
 *  0b0..Double bit fault not detected during a valid flash read access from the platform flash controller
 *  0b1..Double bit fault detected (or FERCNFG[FDFD] is set) during a valid flash read access from the platform flash controller
 */
#define FTFC_FERSTAT_DFDIF(x)                    (((uint8_t)(((uint8_t)(x)) << FTFC_FERSTAT_DFDIF_SHIFT)) & FTFC_FERSTAT_DFDIF_MASK)
/*! @} */

/*! @name FERCNFG - Flash Error Configuration Register */
/*! @{ */

#define FTFC_FERCNFG_DFDIE_MASK                  (0x2U)
#define FTFC_FERCNFG_DFDIE_SHIFT                 (1U)
/*! DFDIE - Double Bit Fault Detect Interrupt Enable
 *  0b0..Double bit fault detect interrupt disabled
 *  0b1..Double bit fault detect interrupt enabled. An interrupt request is generated whenever the FERSTAT[DFDIF] flag is set.
 */
#define FTFC_FERCNFG_DFDIE(x)                    (((uint8_t)(((uint8_t)(x)) << FTFC_FERCNFG_DFDIE_SHIFT)) & FTFC_FERCNFG_DFDIE_MASK)

#define FTFC_FERCNFG_FDFD_MASK                   (0x20U)
#define FTFC_FERCNFG_FDFD_SHIFT                  (5U)
/*! FDFD - Force Double Bit Fault Detect
 *  0b0..FERSTAT[DFDIF] sets only if a double bit fault is detected during read access from the platform flash controller
 *  0b1..FERSTAT[DFDIF] sets during any valid flash read access from the platform flash controller. An interrupt
 *       request is generated if the DFDIE bit is set.
 */
#define FTFC_FERCNFG_FDFD(x)                     (((uint8_t)(((uint8_t)(x)) << FTFC_FERCNFG_FDFD_SHIFT)) & FTFC_FERCNFG_FDFD_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FTFC_Register_Masks */


/*!
 * @}
 */ /* end of group FTFC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FTFC_H_ */

